/**
 * 날짜 : 2018-12-28
 * 
 * Q1 Test4_2에서 사용하는 메서드를 제외하고 모든 IntStack의 모든 메서드를 사용할 수 있는 프로그램을 작성하세요.
 * 
 * Q2 임의의 객체형 데이터를 쌓을 수 있는 제네릭 스택 클래스 Gstack<E>를 작성하세요.
 * 	  public class Gstack<E>
 * Q3 하나의 배열을 공유하여 2개의 스택을 구현하는 int형 데이터용 스택 클래스를 만드세요
 * 스택에 저장하는 데이터는 int형 값으로 아래 그림처럼 배열의 처음과 끝을 사용하세요
 * 
 * Q5 Test4_4에 임의의 데이터를 검색하는 아래의 메서드를 추가하세요
 * int search(int x)
 * 메서드 indexOf처럼 찾은 위치의 배열 인덱스를 반환하는 것이 아니라 
 * 큐 안에서 몇 번째에 있는가를 양수(큐의 프런트에 있는 경우는 1로 함)로 반환합니다. 
 * 검색에 실패할 경우에는 0을 반환합니다.
 * 
 */
package chap04;

public class Wrong_answer {

}
